# W2学会的是怎么描述一个姿态
# W3要学会怎么把好几个姿态串起来，算出末端在哪里
# 1.正运动学（FK）是什么    正逆运动学详见机器人学 可以多过几遍
#                    已知                 求
#  FK正运动学       关节角度          末端位置和姿态
#  IK逆运动学       末端位置             关节角度

# FK简单   给定角度，末端位置唯一；IK难，同一个位置可能有多组角度，甚至可能无解

# 2.先从最简单开始：两连杆机械臂长什么样 （详见机器人学与笔记）
#                    ● 末端
#                   /
#                  /  L2
#                 /
#   ●───────────●
# 关节1   L1   关节2
#         
# 参数：
# 连杆 1 长 L1，从原点出发，角度 θ1（相对 x 轴）
# 连杆 2 长 L2，角度 θ2（相对连杆 1）    
# 求末端 (x, y)     注意角度是有正负的 逆时针为正 顺时针为负

# 3.易错点：θ2 是相对角
# θ2 通常是"相对连杆 1 的角度" —— 所以连杆 2 相对 x 轴的绝对角度是：θ1 + θ2  

# 4.末端坐标推导
# 第一段 连杆1末端 即关节2坐标
# x1 = L1·cos(θ1)
# y1 = L1·sin(θ1)

# 第二段 末端坐标
# x = x1 + L2·cos(θ1 + θ2)
# y = y1 + L2·sin(θ1 + θ2)

# 合起来：
# x = L1·cosθ1 + L2·cos(θ1 + θ2)      
# y = L1·sinθ1 + L2·sin(θ1 + θ2)

# 以上是正运动学最简单的一个推导 往后都在这个基础之上

# 5.代码训练
import numpy as np

def fk_2link(theta1, theta2, L1 = 1.0, L2 = 1.0):
    # 两连杆机械臂正运动学（平面）
    # theta1 : 连杆1 相对 x 轴的角度（弧度）
    # theta2 : 连杆2 相对【连杆1】的角度（弧度）  ← 相对角
    # 返回    : 末端 (x, y)
    x = L1 * np.cos(theta1) + L2 * np.cos(theta1 + theta2)
    y = L1 * np.sin(theta1) + L2 * np.sin(theta1 + theta2)
    return np.array([x, y])

# 单位长度，先验特殊位置
print("伸直  (0°,   0°) :", np.round(fk_2link(0, 0), 3))              # [2, 0]
print("竖直  (90°,  0°) :", np.round(fk_2link(np.pi/2, 0), 3))        # [0, 2]
print("折L形 (0°,  90°) :", np.round(fk_2link(0, np.pi/2), 3))        # [1, 1]
print("反向  (180°, 0°) :", np.round(fk_2link(np.pi, 0), 3))          # [-2, 0]
print("折回  (0°, 180°) :", np.round(fk_2link(0, np.pi), 3))          # [0, 0]

# 用不同长度的L1和L2
print("\nL1=2, L2=1, (0°,0°):", np.round(fk_2link(0, 0, 2, 1), 3))       # [3, 0]
print("L1=2, L2=1, (90°,0°):", np.round(fk_2link(np.pi/2, 0, 2, 1), 3))  # [0, 3]

# 两个理解性的实验
# 实验1 固定 θ1，扫 θ2 —— 末端画什么轨迹？
print("\n固定 θ1 = 0，扫 θ2： ")
for deg in range(0, 361, 20):  # range(起点, 终点, 步长)
    p = fk_2link(0, np.deg2rad(deg))   # np.deg2rad(deg)把循环的角度变为弧度
    print(np.round(p, 3))   # 轨迹画出来是一个以(1，0)为圆心，半径为1的圆

# 实验2 固定θ2，扫 θ1 —— 末端画什么轨迹？
print("\n固定 θ2 = 0，扫 θ1： ")
for deg in range(0, 361, 20): 
    p = fk_2link(np.deg2rad(deg), 0)   
    print(np.round(p, 3))   # 轨迹画出来是一个以(0,0)为圆心，半径为2的圆